# DistributionSysTypeSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysTypeSet Constructor
DistributionSysTypeSet Class See Also
---
Initializes a new instance of the DistributionSysTypeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DistributionSysTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DistributionSysTypeSet()
```

# See Also
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace